from src.bot.lang_pack.base import BaseLangPack


class UKLangPack(BaseLangPack):
    BTN_POWER_STATUS = "💡 Світло 💡"
    BTN_GEN_STATUS = "🔋 Генератор 🔋"
    BTN_SETTINGS = "⚙️ Налаштування ⚙️"
    BTN_REPORT_ERROR = "🆘 Повідомити про помилку 🆘"

    INLINE_BTN_NIGHT_SOUND_ON = "🔊УВІМКНУТИ звук вночі"
    INLINE_BTN_NIGHT_SOUND_OFF = "🔇ВИМКНУТИ звук вночі"
    INLINE_BTN_YES = "Так"
    INLINE_BTN_NO = "Ні"

    MSG_USE_KEYBOARD = "Використовуйте клавіатуру нижче для взаємодії з ботом 👇"
    MSG_NOTIFICATIONS_ON = (
        "Чудово! Сповіщення увімкнено. 🔔\n\n"
        "Бажаєте вимкнути звук для нічних сповіщень "
        "(сповіщення, які надходять у нічний час у період з 22:00 до 08:00, будуть беззвучними)?"
    )
    MSG_WELCOME_USER = "Ласкаво просимо, {username}!"
    MSG_Q_ENABLE_NOTIFS = "Бажаєте увімкнути сповіщення (бот самостійно надсилатиме повідомлення в чат у моменти, коли світло вмикають/вимикають)?"
    MSG_GEN_NOT_REQUIRED = "⚡️ У будинку є світло ⚡️\n\nГенератор не потрібен"
    MSG_GEN_ON = "🔋 *Генератор ПРАЦЮЄ* 🔋"
    MSG_GEN_OFF = "🪫 *Генератор НЕ ПРАЦЮЄ* 🪫"
    MSG_GEN_TIME_TILL_OFF = "⏳ До вимкнення:"
    MSG_GEN_TIME_TILL_ON = "⏳ До ввімкнення:"
    MSG_GEN_FOOTER = (
        "_Зверніть увагу, що робота генератора визначається шляхом звірки з розкладом, "
        "а не фактичною перевіркою\\. Тому реальність може відрізнятися\\!_"
    )
    MSG_POWER_STATUS_NOT_AVAILABLE = "⚠️ Інформація наразі недоступна. Будь ласка, спробуйте пізніше."
    MSG_POWER_IS_ON = "🟢 *Електрика Є\\!* 🟢"
    MSG_POWER_IS_OFF = "🔴 *Електрики НЕМАЄ* 🔴"
    MSG_POWER_TURN_ON_TIME = "📅 Час увімкнення: "
    MSG_POWER_TURN_OFF_TIME = "📅 Час вимкнення: "
    MSG_REPORT_ERROR = "Якщо у вас щось не працює, напишіть мені в особисті повідомлення, все полагодимо та налаштуємо 🤝\n\n@AlexFoxalt"
    MSG_USER_NOT_FOUND = "Користувача не знайдено. Будь ласка, скористайтеся командою /start для реєстрації."
    MSG_NOTIFS_DISABLED = "Сповіщення вимкнено. Ви можете змінити це пізніше.\n\nНалаштування оновлено ✅"
    MSG_NOTIFS_DISABLED_AND_REG_FINISHED = "Сповіщення вимкнено. Ви можете змінити це пізніше."
    MSG_REGISTRATION_COMPLETED = "Реєстрацію завершено! Тепер ви можете користуватися ботом 🎉"
    MSG_NOTIF_NIGHT_SOUND = "Звукове сповіщення в нічний час"
    MSG_SETTINGS_UPDATED = "Налаштування оновлено ✅"

    NOTIF_ATTENTION = "📢️  *УВАГА*  📢"
    NOTIF_POWER_TURN_ON_TIME = "⏳Світло було"
    NOTIF_POWER_TURN_OFF_TIME = "⏳Світла не було"
    NOTIF_FOOTER = "_Ви отримали це повідомлення, тому що увімкнули сповіщення в налаштуваннях бота\\. Їх можна в будь-який момент вимкнути\\._"

    WORD_MINUTES = "хв"
    WORD_HOURS = "год"
    WORD_AND = "і"
    WORD_USER = "Користувач"
    WORD_ELECTRICITY = "Електрика"
    WORD_ENABLED_LOWER = "увімкнено"
    WORD_DISABLED_LOWER = "вимкнено"

    ERR_BOT_NOT_INITIALIZED = "Бота некоректно ініціалізовано. Будь ласка, зв’яжіться з адміністратором."
    ERR_USER_NOT_FOUND = "Користувача не знайдено. Будь ласка, скористайтеся командою /start ще раз."
    ERR_SESSION_EXPIRED = "Термін дії сесії закінчився. Будь ласка, скористайтеся командою /start знову."

    def __repr__(self) -> str:
        return "UK"
